app/views/events/show.html.erb

      <div id="pins" class="transitions-enabled">
        <% @event.galleries.each do |gallery| %>
---
SELECT `galleries`.* FROM `galleries` WHERE `galleries`.`event_id` = 10