app/controllers/admins_controller.rb

  def dashboard
    @events = Event.all.order('created_at desc').limit(10)
    @tests = Testimonial.all.order('created_at desc').limit(6)
    @sliders = Slider.all.order('created_at desc')
---
SELECT  `events`.* FROM `events`  ORDER BY created_at desc LIMIT 10
SELECT  `testimonials`.* FROM `testimonials`  ORDER BY created_at desc LIMIT 6
SELECT `sliders`.* FROM `sliders`  ORDER BY created_at desc