app/controllers/events_controller.rb

SELECT  `sliders`.* FROM `sliders` LIMIT 4
SELECT  `events`.* FROM `events`  ORDER BY created_at desc LIMIT 5
SELECT  `testimonials`.* FROM `testimonials`  ORDER BY created_at desc LIMIT 3
---
  def index
    @sliders = Slider.all.limit(4)
    @events = Event.all.order("created_at desc").limit(5)
    @galleries = Event.all.order("created_at desc").limit(9)
    @testimonials = Testimonial.all.order("created_at desc").limit(3)

SELECT `categories`.* FROM `categories`  ORDER BY name
---
  def new
    @event = current_user.events.build
    @categories = Category.all.order("name")

INSERT INTO `events` (`name`, `description`, `image`, `category_id`, `user_id`, `slug`, `created_at`, `updated_at`) VALUES ('Outing Kalimas Mercy', 'Outbond Mercy Club', 'IMG_7042.JPG', 1, 3, 'outing-kalimas-mercy', '2016-11-02 09:08:43', '2016-11-02 09:08:43')
---
  def create
    @event = current_user.events.build(params_event)
    if @event.save

SELECT `categories`.* FROM `categories`  ORDER BY name
---
  def edit
    @categories = Category.all.order("name")

UPDATE `events` SET `image` = 'CIMG1992.JPG', `updated_at` = '2016-11-02 08:58:01' WHERE `events`.`id` = 10
---
  def update
    if @event.update(params_event)

DELETE FROM `events` WHERE `events`.`id` = 9
---
  def destroy
    @event.destroy

SELECT `events`.* FROM `events`  ORDER BY created_at desc
---
  def all_gallery
    @galleries = Event.all.order('created_at desc')

SELECT `events`.* FROM `events`  ORDER BY created_at desc
---
  def all_event
    @events = Event.all.order('created_at desc')

SELECT  `events`.* FROM `events` WHERE `events`.`id` = 10 LIMIT 1
---
  def set_event
    @event = Event.friendly.find(params[:id])