app/controllers/sliders_controller.rb

INSERT INTO `sliders` (`image`, `caption`, `subcaption`, `created_at`) VALUES ('IMG_1336.JPG', 'Tak Pernah Libur Untuk Menghibur', '', '2016-11-02 08:50:39')
---
  def create
    @slider = Slider.new(params_slider)
    if @slider.save

DELETE FROM `sliders` WHERE `sliders`.`id` = 5
---
  def destroy
    @slider.destroy

SELECT `sliders`.* FROM `sliders`  ORDER BY created_at desc
---
  def all_slider
    @sliders = Slider.all.order('created_at desc')

SELECT  `sliders`.* FROM `sliders` WHERE `sliders`.`id` = 7 LIMIT 1
---
  def set_slider
    @slider = Slider.find(params[:id])