app/controllers/testimonials_controller.rb

  def create
    @testimonial = Testimonial.new(params_test)
    if @testimonial.save
---
INSERT INTO `testimonials` (`name`, `content`, `avatar`, `occupation`, `created_at`, `updated_at`) VALUES ('Ras Muhammad', 'Saya merasa puas dengan servis yang diberikan Event Organizer Ruang Ide', 'raas.png', 'Musisi', '2016-11-02 09:44:14', '2016-11-02 09:44:14')

  def all_testimonial
    @tests = Testimonial.all.order('created_at desc')
---
SELECT `testimonials`.* FROM `testimonials`  ORDER BY created_at desc

  def destroy
    @testimonial.destroy
---
DELETE FROM `testimonials` WHERE `testimonials`.`id` = 6

  def set_test
    @testimonial = Testimonial.find(params[:id])
---
SELECT  `testimonials`.* FROM `testimonials` WHERE `testimonials`.`id` = 6 LIMIT 1