app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO `users` (`username`, `first_name`, `status`, `last_name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('ganda', 'ganda', 0, 'anggara', 'gandaanggara.mr@gmail.com', '$2a$10$g/TmYVxPx7acNbAWPyV96eKDlACwjwWx.PBdT4JYsW97uJbYSpWga', '2016-11-02 07:53:42', '2016-11-02 07:53:42')

  def all_user
    @users = User.all.order('created_at desc')
---
SELECT `users`.* FROM `users`  ORDER BY created_at desc

  def update
    if @user.update(user_params)
---
UPDATE `users` SET `first_name` = '565gdfg1', `last_name` = '23fdsg78', `updated_at` = '2016-11-02 08:02:21' WHERE `users`.`id` = 3

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 2

  def find_user
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1